Tekla Open API Reference for Tekla Structures 2025
ReinforcementPulloutElement Class
 The ReinforcementPulloutElement class illustrates the shape and dimensions of a reinforcing bar in a drawing.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.ElementBase
 Tekla.Structures.Drawing.ReinforcementPulloutElement
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ReinforcementPulloutElement : ElementBase
<SerializableAttribute>
Public NotInheritable Class ReinforcementPulloutElement
	Inherits ElementBase
The ReinforcementPulloutElement type exposes the following members.
Constructors
Name | Description
ReinforcementPulloutElement
 Creates a new reinforcement pull-out element instance.
Top
Properties
Name | Description
AutomaticScaling
 Gets or sets a value indicating whether the pull-out is scaled automatically or to a specified value.
BendingAngle
 Gets or sets a value indicating whether to show the pull-out bending angles.
BendingRadius
 Gets or sets a value indicating whether to show the pull-out bending radii.
CouplersEndAnchorSymbols
 Gets or sets a value indicating whether to show coupler/anchor symbols or not.
CouplersScale
 Gets or sets the scale of coupler/anchor symbols.
Dimensioning
 Gets or sets a value indicating whether to show the pull-out dimensions.
EndSymbolType
 Gets or sets the type of the ending marks.
Exaggeration
 Gets or sets a value indicating whether the pull-out is exaggerated.
Font
 Gets or sets the font of the dimension.
RotationAxis
 Gets or sets the rotation of the pull-out.
ScaleX
 Gets or sets the scaling of the pull-out in the X direction.
ScaleY
 Gets or sets the scaling of the pull-out in the Y direction.
Top
Methods
Name | Description
Clone
 Clones the object.
 (Overrides ElementBase.Clone().)
GetUnformattedString
 Returns the content as a string without formatting.
 (Overrides ElementBase.GetUnformattedString().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ElementBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace